{
  "spells": [
    {
      "name": "Guidance",
      "level": 0,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends."
    },
    {
      "name": "Sacred Flame",
      "level": 0,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 radiant damage. The target gains no benefit from cover for this saving throw."
    },
    {
      "name": "Thaumaturgy",
      "level": 0,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "Up to 1 minute",
      "description": "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range: Your voice booms up to three times as loud as normal for 1 minute. You cause flames to flicker, brighten, dim, or change color for 1 minute. You cause harmless tremors in the ground for 1 minute. You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers. You instantaneously cause an unlocked door or window to fly open or slam shut. You alter the appearance of your eyes for 1 minute."
    },
    {
      "name": "Toll the Dead",
      "level": 0,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage."
    },
    {
      "name": "Word of Radiance",
      "level": 0,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "5 feet",
      "components": "V, M",
      "duration": "Instantaneous",
      "description": "You utter a divine word, and burning radiance erupts from you. Each creature of your choice that you can see within range must succeed on a Constitution saving throw or take 1d6 radiant damage."
    },
    {
      "name": "Mending",
      "level": 0,
      "school": "Transmutation",
      "castingTime": "1 minute",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage."
    },
    {
      "name": "Resistance",
      "level": 0,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends."
    },
    {
      "name": "Spare the Dying",
      "level": 0,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs."
    },
    {
      "name": "Bless",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw."
    },
    {
      "name": "Command",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": "1 round",
      "description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn't understand your language, or if your command is directly harmful to it."
    },
    {
      "name": "Create or Destroy Water",
      "level": 1,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You either create or destroy water. Create Water: You create up to 10 gallons of clean water within range in an open container. Destroy Water: You destroy up to 10 gallons of water in an open container within range."
    },
    {
      "name": "Cure Wounds",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
    },
    {
      "name": "Detect Evil and Good",
      "level": 1,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated."
    },
    {
      "name": "Detect Magic",
      "level": 1,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any."
    },
    {
      "name": "Detect Poison and Disease",
      "level": 1,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case."
    },
    {
      "name": "Guiding Bolt",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "1 round",
      "description": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then."
    },
    {
      "name": "Healing Word",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V",
      "duration": "Instantaneous",
      "description": "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
    },
    {
      "name": "Inflict Wounds",
      "level": 1,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage."
    },
    {
      "name": "Protection from Evil and Good",
      "level": 1,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead. The protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them."
    },
    {
      "name": "Purify Food and Drink",
      "level": 1,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "All nonmagical food and drink within a 5-foot-radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease."
    },
    {
      "name": "Sanctuary",
      "level": 1,
      "school": "Abjuration",
      "castingTime": "1 bonus action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "1 minute",
      "description": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball."
    },
    {
      "name": "Shield of Faith",
      "level": 1,
      "school": "Abjuration",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
    },
    {
      "name": "Aid",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "8 hours",
      "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration."
    },
    {
      "name": "Augury",
      "level": 2,
      "school": "Divination",
      "castingTime": "1 minute",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "By casting gem-inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes."
    },
    {
      "name": "Blindness/Deafness",
      "level": 2,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "1 minute",
      "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends."
    },
    {
      "name": "Calm Emotions",
      "level": 2,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes."
    },
    {
      "name": "Continual Flame",
      "level": 2,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Until dispelled",
      "description": "A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched."
    },
    {
      "name": "Enhance Ability",
      "level": 2,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 hour",
      "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends."
    },
    {
      "name": "Find Traps",
      "level": 2,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You sense the presence of any trap within range that is within line of sight. A trap, for the purpose of this spell, includes anything that would inflict a sudden or unexpected effect you consider harmful or undesirable, which was specifically intended as such by its creator."
    },
    {
      "name": "Gentle Repose",
      "level": 2,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "10 days",
      "description": "You touch a corpse or other remains. For the duration, the target is protected from decay and can't become undead. The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead."
    },
    {
      "name": "Hold Person",
      "level": 2,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."
    },
    {
      "name": "Lesser Restoration",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."
    },
    {
      "name": "Locate Object",
      "level": 2,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement."
    },
    {
      "name": "Prayer of Healing",
      "level": 2,
      "school": "Evocation",
      "castingTime": "10 minutes",
      "range": "30 feet",
      "components": "V",
      "duration": "Instantaneous",
      "description": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
    },
    {
      "name": "Protection from Poison",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that is known to you, or you neutralize one at random. For the duration, the target has advantage on saving throws against being poisoned, and resistance to poison damage."
    },
    {
      "name": "Silence",
      "level": 2,
      "school": "Illusion",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it."
    },
    {
      "name": "Spiritual Weapon",
      "level": 2,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "1 minute",
      "description": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier."
    },
    {
      "name": "Warding Bond",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage."
    },
    {
      "name": "Zone of Truth",
      "level": 2,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw."
    },
    {
      "name": "Animate Dead",
      "level": 3,
      "school": "Necromancy",
      "castingTime": "1 minute",
      "range": "10 feet",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature."
    },
    {
      "name": "Aura of Vitality",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points."
    },
    {
      "name": "Beacon of Hope",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing."
    },
    {
      "name": "Bestow Curse",
      "level": 3,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or be cursed for the duration of the spell."
    },
    {
      "name": "Clairvoyance",
      "level": 3,
      "school": "Divination",
      "castingTime": "10 minutes",
      "range": "1 mile",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees)."
    },
    {
      "name": "Create Food and Water",
      "level": 3,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if not consumed within 24 hours. The water is clean and doesn't go bad."
    },
    {
      "name": "Daylight",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet."
    },
    {
      "name": "Dispel Magic",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."
    },
    {
      "name": "Feign Death",
      "level": 3,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death."
    },
    {
      "name": "Glyph of Warding",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 hour",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Until dispelled or triggered",
      "description": "When you cast this spell, you inscribe a glyph that harms other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph."
    },
    {
      "name": "Magic Circle",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 minute",
      "range": "10 feet",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the ground or another surface."
    },
    {
      "name": "Mass Healing Word",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V",
      "duration": "Instantaneous",
      "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier."
    },
    {
      "name": "Meld into Stone",
      "level": 3,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration."
    },
    {
      "name": "Protection from Energy",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder."
    },
    {
      "name": "Remove Curse",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded."
    },
    {
      "name": "Revivify",
      "level": 3,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts."
    },
    {
      "name": "Sending",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Unlimited",
      "components": "V, S, M",
      "duration": "1 round",
      "description": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately."
    },
    {
      "name": "Speak with Dead",
      "level": 3,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S, M",
      "duration": "10 minutes",
      "description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose."
    },
    {
      "name": "Spirit Guardians",
      "level": 3,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Self (15-foot radius)",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish."
    },
    {
      "name": "Tongues",
      "level": 3,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, M",
      "duration": "1 hour",
      "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says."
    },
    {
      "name": "Water Walk",
      "level": 3,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "This spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat)."
    },
    {
      "name": "Aura of Life",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 10 minutes",
      "description": "Life-preserving energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can't be reduced."
    },
    {
      "name": "Aura of Purity",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 10 minutes",
      "description": "Purifying energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each creature in the aura (including you) can't become diseased, has resistance to poison damage, and has advantage on saving throws against effects that cause certain conditions."
    },
    {
      "name": "Banishment",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a Charisma saving throw or be banished."
    },
    {
      "name": "Control Water",
      "level": 4,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "300 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast the spell."
    },
    {
      "name": "Death Ward",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends."
    },
    {
      "name": "Divination",
      "level": 4,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "Your magic and an offering put you in contact with a god or a god's servants. You ask a single question concerning a specific goal, event, or activity to occur within 7 days. The DM offers a truthful reply."
    },
    {
      "name": "Freedom of Movement",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained."
    },
    {
      "name": "Guardian of Faith",
      "level": 4,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V",
      "duration": "8 hours",
      "description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity."
    },
    {
      "name": "Locate Creature",
      "level": 4,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 hour",
      "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you."
    },
    {
      "name": "Stone Shape",
      "level": 4,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose."
    },
    {
      "name": "Commune",
      "level": 5,
      "school": "Divination",
      "castingTime": "1 minute",
      "range": "Self",
      "components": "V, S, M",
      "duration": "1 minute",
      "description": "You contact your deity or a divine proxy and ask up to three questions that can be answered with a yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question."
    },
    {
      "name": "Contagion",
      "level": 5,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "7 days",
      "description": "Your touch inflicts disease. Make a melee spell attack against a creature within your reach. On a hit, you afflict the target with a disease of your choice from any of the ones described below."
    },
    {
      "name": "Dispel Evil and Good",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane. For the duration, celestials, elementals, fey, fiends, and undead have disadvantage on attack rolls against you."
    },
    {
      "name": "Flame Strike",
      "level": 5,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a Dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Geas",
      "level": 5,
      "school": "Enchantment",
      "castingTime": "1 minute",
      "range": "60 feet",
      "components": "V",
      "duration": "30 days",
      "description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide."
    },
    {
      "name": "Greater Restoration",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target's exhaustion level by one, or end one of the following effects on the target."
    },
    {
      "name": "Hallow",
      "level": 5,
      "school": "Evocation",
      "castingTime": "24 hours",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Until dispelled",
      "description": "You touch a point and infuse an area around it with holy (or unholy) power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect a hallow spell."
    },
    {
      "name": "Insect Plague",
      "level": 5,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "300 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is difficult terrain."
    },
    {
      "name": "Legend Lore",
      "level": 5,
      "school": "Divination",
      "castingTime": "10 minutes",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named."
    },
    {
      "name": "Mass Cure Wounds",
      "level": 5,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "A wave of healing energy flows out from a point of your choice within range. Choose up to six creatures in a 30-foot-radius sphere centered on that point. Each target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
    },
    {
      "name": "Planar Binding",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 hour",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "24 hours",
      "description": "With this spell, you attempt to bind a celestial, an elemental, a fey, or a fiend to your service."
    },
    {
      "name": "Raise Dead",
      "level": 5,
      "school": "Necromancy",
      "castingTime": "1 hour",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point."
    },
    {
      "name": "Scrying",
      "level": 5,
      "school": "Divination",
      "castingTime": "10 minutes",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "You can see and hear a particular creature you choose that is on the same plane of existence as you."
    },
    {
      "name": "Blade Barrier",
      "level": 6,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "You create a vertical wall of whirling, razor-sharp blades made of magical energy. The wall appears within range and lasts for the duration."
    },
    {
      "name": "Create Undead",
      "level": 6,
      "school": "Necromancy",
      "castingTime": "1 minute",
      "range": "10 feet",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control."
    },
    {
      "name": "Find the Path",
      "level": 6,
      "school": "Divination",
      "castingTime": "1 minute",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 day",
      "description": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence."
    },
    {
      "name": "Forbiddance",
      "level": 6,
      "school": "Abjuration",
      "castingTime": "10 minutes",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 day",
      "description": "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor."
    },
    {
      "name": "Harm",
      "level": 6,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You unleash a virulent disease on a creature that you can see within range. The target must make a Constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save."
    },
    {
      "name": "Heal",
      "level": 6,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "Choose a creature that you can see within range. A flood of positive energy washes through the creature, causing it to regain 70 hit points. This spell also ends blindness, deafness, and any diseases affecting the target."
    },
    {
      "name": "Heroes' Feast",
      "level": 6,
      "school": "Conjuration",
      "castingTime": "10 minutes",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You bring forth a great feast, including magnificent food and drink. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don't set in until this hour is over."
    },
    {
      "name": "Planar Ally",
      "level": 6,
      "school": "Conjuration",
      "castingTime": "10 minutes",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power."
    },
    {
      "name": "True Seeing",
      "level": 6,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."
    },
    {
      "name": "Word of Recall",
      "level": 6,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "5 feet",
      "components": "V",
      "duration": "Instantaneous",
      "description": "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary."
    },
    {
      "name": "Conjure Celestial",
      "level": 7,
      "school": "Conjuration",
      "castingTime": "1 minute",
      "range": "90 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 hour",
      "description": "You summon a celestial of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The celestial disappears when it drops to 0 hit points or when the spell ends."
    },
    {
      "name": "Divine Word",
      "level": 7,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "30 feet",
      "components": "V",
      "duration": "Instantaneous",
      "description": "You utter a divine word, and burning radiance erupts from you. Each creature of your choice that you can see within range must succeed on a Charisma saving throw or be affected by one of the following effects."
    },
    {
      "name": "Etherealness",
      "level": 7,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Up to 8 hours",
      "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane."
    },
    {
      "name": "Fire Storm",
      "level": 7,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "150 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "A storm of fire appears in a shape you choose. Each creature in the area must make a Dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one."
    },
    {
      "name": "Plane Shift",
      "level": 7,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence of your choice."
    },
    {
      "name": "Regenerate",
      "level": 7,
      "school": "Transmutation",
      "castingTime": "1 minute",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute)."
    },
    {
      "name": "Resurrection",
      "level": 7,
      "school": "Necromancy",
      "castingTime": "1 hour",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead. If its soul is free and willing, the target returns to life with all its hit points."
    },
    {
      "name": "Symbol",
      "level": 7,
      "school": "Abjuration",
      "castingTime": "1 minute",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Until dispelled or triggered",
      "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest)."
    },
    {
      "name": "Antimagic Field",
      "level": 8,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (10-foot-radius sphere)",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 hour",
      "description": "A 10-foot-radius invisible sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the sphere, spells can't be cast, summoned creatures disappear, and even magic items become mundane."
    },
    {
      "name": "Control Weather",
      "level": 8,
      "school": "Transmutation",
      "castingTime": "10 minutes",
      "range": "Self (5-mile radius)",
      "components": "V, S, M",
      "duration": "Concentration, up to 8 hours",
      "description": "You take control of the weather within 5 miles of you for the duration. You must be outdoors to cast this spell. Moving to a place where you don't have a clear path to the sky ends the spell early."
    },
    {
      "name": "Earthquake",
      "level": 8,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "500 feet",
      "components": "V, S, M",
      "duration": "1 minute",
      "description": "You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor ripples through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area."
    },
    {
      "name": "Holy Aura",
      "level": 8,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "Divine light washes out from you and coalesces in a soft radiance in a 30-foot radius around you. Creatures of your choice in that radius when you cast the spell shed dim light in a 5-foot radius and have advantage on all saving throws, and other creatures have disadvantage on attack rolls against them until the spell ends."
    },
    {
      "name": "Astral Projection",
      "level": 9,
      "school": "Necromancy",
      "castingTime": "1 hour",
      "range": "10 feet",
      "components": "V, S, M",
      "duration": "Special",
      "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane. The material body you leave behind is unconscious and in a state of suspended animation; it doesn't need food or air and doesn't age."
    },
    {
      "name": "Gate",
      "level": 9,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter."
    },
    {
      "name": "Mass Heal",
      "level": 9,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 hit points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened."
    },
    {
      "name": "True Resurrection",
      "level": 9,
      "school": "Necromancy",
      "castingTime": "1 hour",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You touch a creature that has been dead for no longer than 200 years and that didn't die of old age. If the creature's soul is free and willing, the target returns to life with all its hit points."
    }
  ]
}
