{
  "spells": [
    {
      "name": "Bless",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw."
    },
    {
      "name": "Command",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V",
      "duration": "1 round",
      "description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn't understand your language, or if your command is directly harmful to it."
    },
    {
      "name": "Compelled Duel",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 bonus action",
      "range": "30 feet",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "You attempt to compel a creature into a duel. One creature that you can see within range must make a Wisdom saving throw. On a failed save, the creature is drawn to you, compelled by your divine demand. For the duration, it has disadvantage on attack rolls against creatures other than you, and must make a Wisdom saving throw each time it attempts to move to a space that is more than 30 feet away from you; if it succeeds on this saving throw, this spell doesn't restrict the target's movement for that turn."
    },
    {
      "name": "Cure Wounds",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
    },
    {
      "name": "Detect Evil and Good",
      "level": 1,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated."
    },
    {
      "name": "Detect Magic",
      "level": 1,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any."
    },
    {
      "name": "Detect Poison and Disease",
      "level": 1,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "For the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case."
    },
    {
      "name": "Divine Favor",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "Your prayer empowers you with divine radiance. Until the spell ends, your weapon attacks deal an extra 1d4 radiant damage on a hit."
    },
    {
      "name": "Divine Smite",
      "level": 1,
      "school": "Evocation",
      "castingTime": "Special",
      "range": "Self",
      "components": "V",
      "duration": "Instantaneous",
      "description": "When you hit a creature with a weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."
    },
    {
      "name": "Heroism",
      "level": 1,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "description": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to being frightened and gains temporary hit points equal to your spellcasting ability modifier at the start of each of its turns. When the spell ends, the target loses any remaining temporary hit points from this spell."
    },
    {
      "name": "Protection from Evil and Good",
      "level": 1,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead. The protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them."
    },
    {
      "name": "Purify Food and Drink",
      "level": 1,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "10 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "All nonmagical food and drink within a 5-foot-radius sphere centered on a point of your choice within range is purified and rendered free of poison and disease."
    },
    {
      "name": "Searing Smite",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with white-hot intensity, and the attack deals an extra 1d6 fire damage to the target and causes the target to ignite in flames. At the start of each of its turns until the spell ends, the target must make a Constitution saving throw. On a failed save, it takes 1d6 fire damage. On a successful save, the spell ends."
    },
    {
      "name": "Shield of Faith",
      "level": 1,
      "school": "Abjuration",
      "castingTime": "1 bonus action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
    },
    {
      "name": "Thunderous Smite",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The first time you hit with a melee weapon attack during this spell's duration, your weapon rings with thunder that is audible within 300 feet of you, and the attack deals an extra 2d6 thunder damage to the target. Additionally, if the target is a creature, it must make a Strength saving throw or be pushed 10 feet away from you and knocked prone."
    },
    {
      "name": "Wrathful Smite",
      "level": 1,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The next time you hit with a melee weapon attack during this spell's duration, your attack deals an extra 1d6 psychic damage. Additionally, if the target is a creature, it must make a Wisdom saving throw or be frightened of you until the spell ends. As an action, the creature can make a Wisdom check against your spell save DC to steel its resolve and end this spell."
    },
    {
      "name": "Aid",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S, M",
      "duration": "8 hours",
      "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration."
    },
    {
      "name": "Find Steed",
      "level": 2,
      "school": "Conjuration",
      "castingTime": "10 minutes",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You summon a spirit that assumes the form of an unusually intelligent, strong, and loyal steed, creating a long-lasting bond with it. Appearing in an unoccupied space within range, the steed takes on a form that you choose: a warhorse, a pony, a camel, an elk, or a mastiff. The steed has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of its normal type."
    },
    {
      "name": "Gentle Repose",
      "level": 2,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "10 days",
      "description": "You touch a corpse or other remains. For the duration, the target is protected from decay and can't become undead. The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead."
    },
    {
      "name": "Hold Person",
      "level": 2,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."
    },
    {
      "name": "Lesser Restoration",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."
    },
    {
      "name": "Locate Object",
      "level": 2,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 10 minutes",
      "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement."
    },
    {
      "name": "Magic Weapon",
      "level": 2,
      "school": "Transmutation",
      "castingTime": "1 bonus action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls."
    },
    {
      "name": "Prayer of Healing",
      "level": 2,
      "school": "Evocation",
      "castingTime": "10 minutes",
      "range": "30 feet",
      "components": "V",
      "duration": "Instantaneous",
      "description": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
    },
    {
      "name": "Protection from Poison",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "1 hour",
      "description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that is known to you, or you neutralize one at random. For the duration, the target has advantage on saving throws against being poisoned, and resistance to poison damage."
    },
    {
      "name": "Shining Smite",
      "level": 2,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with bright light, and the attack deals an extra 2d6 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends."
    },
    {
      "name": "Warding Bond",
      "level": 2,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage."
    },
    {
      "name": "Zone of Truth",
      "level": 2,
      "school": "Enchantment",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "10 minutes",
      "description": "You create a magical zone that guards against deception in a 15-foot-radius sphere centered on a point of your choice within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there must make a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw."
    },
    {
      "name": "Aura of Vitality",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points."
    },
    {
      "name": "Blinding Smite",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with bright light, and the attack deals an extra 3d8 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends."
    },
    {
      "name": "Create Food and Water",
      "level": 3,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if not consumed within 24 hours. The water is clean and doesn't go bad."
    },
    {
      "name": "Crusader's Mantle",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "Holy power radiates from you in an aura with a 30-foot radius, awakening boldness in friendly creatures. Until the spell ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) deals an extra 1d4 radiant damage when it hits with a weapon attack."
    },
    {
      "name": "Daylight",
      "level": 3,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "1 hour",
      "description": "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet. If you chose a point on an object you are holding or one that isn't being worn or carried, the light emanates from the object and moves with it. Completely covering the affected object with an opaque object, such a bowl or a helm, blocks the light."
    },
    {
      "name": "Dispel Magic",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "120 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends."
    },
    {
      "name": "Elemental Weapon",
      "level": 3,
      "school": "Transmutation",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Concentration, up to 1 hour",
      "description": "A nonmagical weapon you touch becomes a magic weapon. Choose one of the following damage types: acid, cold, fire, lightning, or thunder. For the duration, the weapon has a +1 bonus to attack rolls and deals an extra 1d4 damage of the chosen type when it hits."
    },
    {
      "name": "Magic Circle",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 minute",
      "range": "10 feet",
      "components": "V, S, M",
      "duration": "1 hour",
      "description": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the ground or another surface. Choose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways: The creature can't willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a Charisma saving throw. The creature has disadvantage on attack rolls against targets within the cylinder. Targets within the cylinder can't be charmed, frightened, or possessed by the creature."
    },
    {
      "name": "Remove Curse",
      "level": 3,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded."
    },
    {
      "name": "Revivify",
      "level": 3,
      "school": "Necromancy",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts."
    },
    {
      "name": "Aura of Life",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 10 minutes",
      "description": "Life-preserving energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can't be reduced. In addition, a nonhostile, living creature in the aura regains 1 hit point when it starts its turn there with 0 hit points."
    },
    {
      "name": "Aura of Purity",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 10 minutes",
      "description": "Purifying energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each creature in the aura (including you) can't become diseased, has resistance to poison damage, and has advantage on saving throws against effects that cause any of the following conditions: blinded, charmed, deafened, frightened, paralyzed, poisoned, and stunned."
    },
    {
      "name": "Banishment",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "60 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a Charisma saving throw or be banished. If the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied."
    },
    {
      "name": "Death Ward",
      "level": 4,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "8 hours",
      "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends. If the spell is still in effect when the target is subjected to an effect that would kill it instantaneously without dealing damage, that effect is instead negated against the target, and the spell ends."
    },
    {
      "name": "Locate Creature",
      "level": 4,
      "school": "Divination",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 hour",
      "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement. The spell can locate a specific creature known to you, or the nearest creature of a specific kind (such as a human or a unicorn), so long as you have seen such a creature up close—within 30 feet—at least once."
    },
    {
      "name": "Staggering Smite",
      "level": 4,
      "school": "Evocation",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon pierces both body and mind, and the attack deals an extra 4d6 psychic damage to the target. The target must make a Wisdom saving throw. On a failed save, it has disadvantage on attack rolls and ability checks, and can't take reactions, until the end of its next turn."
    },
    {
      "name": "Banishing Smite",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "description": "The next time you hit a creature with a weapon attack before this spell ends, your weapon crackles with force, and the attack deals an extra 5d10 force damage to the target. Additionally, if this attack reduces the target to 50 hit points or fewer, you banish it. If the target is native to a different plane of existence than the one you're on, the target disappears, returning to its home plane. If the target is native to the plane you're on, the creature vanishes into a harmless demiplane."
    },
    {
      "name": "Circle of Power",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Concentration, up to 10 minutes",
      "description": "Divine energy radiates from you, distorting and diffusing magical energy within 30 feet of you. Until the spell ends, the sphere moves with you, centered on you. For the duration, each friendly creature in the area (including you) has advantage on saving throws against spells and other magical effects. Additionally, when an affected creature succeeds on a saving throw made against a spell or magical effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw."
    },
    {
      "name": "Destructive Wave",
      "level": 5,
      "school": "Evocation",
      "castingTime": "1 action",
      "range": "Self (30-foot radius)",
      "components": "V",
      "duration": "Instantaneous",
      "description": "You strike the ground, creating a burst of divine energy that ripples outward from you. Each creature you choose within 30 feet of you must make a Constitution saving throw. A creature takes 5d6 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw. A nonmagical object that isn't being worn or carried also takes the damage if it's in the spell's area."
    },
    {
      "name": "Dispel Evil and Good",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Self",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 minute",
      "description": "Shimmering energy surrounds and protects you from fey, undead, and creatures originating from beyond the Material Plane. For the duration, celestials, elementals, fey, fiends, and undead have disadvantage on attack rolls against you. You can end the spell early by using either of the following special functions. Break Enchantment. As your action, you touch a creature you can see and end one spell on it. Dismissal. As your action, make a melee spell attack against a celestial, an elemental, a fey, a fiend, or an undead you can see. On a hit, you attempt to drive the creature back to its home plane. The creature must succeed on a Charisma saving throw or be sent back to its home plane (if it isn't there already)."
    },
    {
      "name": "Geas",
      "level": 5,
      "school": "Enchantment",
      "castingTime": "1 minute",
      "range": "60 feet",
      "components": "V",
      "duration": "30 days",
      "description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide. If the creature can understand you, it must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed by you, it takes 5d10 psychic damage each time it acts in a manner directly counter to your instructions, but no more than once each day. A creature that can't understand you is unaffected by the spell."
    },
    {
      "name": "Greater Restoration",
      "level": 5,
      "school": "Abjuration",
      "castingTime": "1 action",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target's exhaustion level by one, or end one of the following effects on the target: One effect that charmed or petrified the target. One curse, including the target's attunement to a cursed magic item. Any reduction to one of the target's ability scores. One effect reducing the target's hit point maximum."
    },
    {
      "name": "Raise Dead",
      "level": 5,
      "school": "Necromancy",
      "castingTime": "1 hour",
      "range": "Touch",
      "components": "V, S, M",
      "duration": "Instantaneous",
      "description": "You return a dead creature you touch to life, provided that it has been dead no longer than 10 days. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point. This spell also neutralizes any poisons and cures nonmagical diseases that affected the creature at the time it died. This spell doesn't, however, remove magical diseases, curses, or similar effects; if these aren't removed prior to casting the spell, they take effect when the creature returns to life."
    },
    {
      "name": "Summon Celestial",
      "level": 5,
      "school": "Conjuration",
      "castingTime": "1 action",
      "range": "90 feet",
      "components": "V, S, M",
      "duration": "Concentration, up to 1 hour",
      "description": "You call forth a celestial spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Celestial Spirit stat block. When you cast the spell, choose Avenger or Defender. Your choice determines the creature's attack in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends."
    }
  ]
}
