{
  "hitDie": 12,
  "hp": {
    "starting": { "base": "maxHitDie", "addCon": true },
    "levelUp": { "average": "halfHitDieFloor", "addCon": true, "minGain": 1 }
  },
  "multiclassRequirements": {
    "primaryAbility": "strength",
    "minScore": 13
  },
  "multiclassProficiencies": {
    "proficiencies": ["Martial Weapons"],
    "armorTraining": ["Shields"]
  },
  "resources": {
    "rage": {
      "label": "Rage",
      "description": "Uses per Long Rest. You can enter a Rage as a Bonus Action (spending 1 use). While raging, you gain damage and durability benefits; see the Rage feature description.",
      "reset": "longRest",
      "trackActive": true,
      "maxByLevel": { "1": 2 }
    }
  },
  "levels": {
    "1": {
      "features": [
        {
          "name": "Rage",
          "description": "You can enter a Rage as a Bonus Action. While raging, you have resistance to bludgeoning, piercing, and slashing damage, gain a bonus to damage rolls with Strength-based attacks, and have advantage on Strength checks and saving throws. You can’t cast spells or maintain Concentration while raging. Rage lasts until the end of your next turn and can be extended. You can use Rage a limited number of times and regain expended uses when you finish a Long Rest.",
          "resourceRef": "rage"
        },
        {
          "name": "Unarmored Defense",
          "description": "While you aren’t wearing any armor, your base Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a Shield and still gain this benefit."
        }
      ]
    },
    "2": {
      "features": [
        {
          "name": "Danger Sense",
          "description": "You gain an uncanny sense of when things aren’t as they should be, giving you an edge when you dodge perils. You have Advantage on Dexterity saving throws, provided you don’t have the Incapacitated condition."
        },
        {
          "name": "Reckless Attack",
          "description": "You can throw aside all concern for defense to attack with fierce ferocity. When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time."
        }
      ]
    }
  }
}
