{
  "hitDie": 10,
  "hp": {
    "starting": { "base": "maxHitDie", "addCon": true },
    "levelUp": { "average": "halfHitDieFloor", "addCon": true, "minGain": 1 }
  },
  "multiclassRequirements": {
    "primaryAbilities": ["strength", "charisma"],
    "minScore": 13
  },
  "multiclassProficiencies": {
    "proficiencies": ["Martial Weapons"],
    "armorTraining": ["Light Armor", "Medium Armor", "Shields"]
  },
  "resources": {
    "layOnHands": {
      "label": "Lay on Hands",
      "description": "You have a pool of healing power that replenishes when you take a Long Rest. With that pool, you can restore a total number of Hit Points equal to your Paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of Hit Points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 Hit Points from the pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending Hit Points separately for each one.",
      "reset": "longRest",
      "trackActive": false,
      "maxByLevel": {
        "1": 5,
        "2": 10,
        "3": 15,
        "4": 20,
        "5": 25,
        "6": 30,
        "7": 35,
        "8": 40,
        "9": 45,
        "10": 50,
        "11": 55,
        "12": 60,
        "13": 65,
        "14": 70,
        "15": 75,
        "16": 80,
        "17": 85,
        "18": 90,
        "19": 95,
        "20": 100
      }
    }
  },
  "levels": {
    "1": {
      "features": [
        {
          "name": "Divine Sense",
          "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity. Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a Long Rest, you regain all expended uses."
        },
        {
          "name": "Lay on Hands",
          "description": "You have a pool of healing power that replenishes when you take a Long Rest. With that pool, you can restore a total number of Hit Points equal to your Paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of Hit Points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 Hit Points from the pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending Hit Points separately for each one.",
          "resourceRef": "layOnHands"
        },
        {
          "name": "Weapon Mastery",
          "description": "Your training with weapons allows you to use the Mastery property of two kinds of weapons of your choice with which you have proficiency, such as Longswords and Javelins. Whenever you finish a Long Rest, you can change the kinds of weapons you chose."
        }
      ]
    },
    "2": {
      "features": [
        {
          "name": "Fighting Style",
          "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again."
        },
        {
          "name": "Spellcasting",
          "description": "You have learned to cast spells through prayer, meditation, and devotion. You prepare the list of level 1+ spells that are available for you to cast. To start, choose two level 1 spells from the Paladin spell list. The number of spells on your list increases as you gain Paladin levels. Whenever that number increases, choose additional spells from the Paladin spell list until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots. You can replace one spell on your list with another Paladin spell for which you have spell slots whenever you finish a Long Rest."
        },
        {
          "name": "Divine Smite",
          "description": "When you hit a creature with a weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."
        }
      ]
    },
    "3": {
      "features": [
        {
          "name": "Divine Health",
          "description": "The divine magic flowing through you makes you immune to disease."
        },
        {
          "name": "Sacred Oath",
          "description": "When you reach 3rd level, you swear the oath that binds you as a Paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level."
        }
      ]
    },
    "4": {
      "features": [
        {
          "name": "Ability Score Improvement",
          "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
        }
      ]
    },
    "5": {
      "features": [
        {
          "name": "Extra Attack",
          "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
        }
      ]
    },
    "6": {
      "features": [
        {
          "name": "Aura of Protection",
          "description": "Whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet."
        }
      ]
    },
    "7": {
      "features": [
        {
          "name": "Sacred Oath Feature",
          "description": "You gain a feature from your Sacred Oath."
        }
      ]
    },
    "8": {
      "features": [
        {
          "name": "Ability Score Improvement",
          "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
        }
      ]
    },
    "10": {
      "features": [
        {
          "name": "Aura of Courage",
          "description": "You and friendly creatures within 10 feet of you can't be frightened while you are conscious. At 18th level, the range of this aura increases to 30 feet."
        }
      ]
    },
    "11": {
      "features": [
        {
          "name": "Improved Divine Smite",
          "description": "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite."
        }
      ]
    },
    "12": {
      "features": [
        {
          "name": "Ability Score Improvement",
          "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
        }
      ]
    },
    "14": {
      "features": [
        {
          "name": "Cleansing Touch",
          "description": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a Long Rest."
        }
      ]
    },
    "15": {
      "features": [
        {
          "name": "Sacred Oath Feature",
          "description": "You gain a feature from your Sacred Oath."
        }
      ]
    },
    "16": {
      "features": [
        {
          "name": "Ability Score Improvement",
          "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
        }
      ]
    },
    "18": {
      "features": [
        {
          "name": "Aura Improvements",
          "description": "The range of your auras increases to 30 feet."
        }
      ]
    },
    "19": {
      "features": [
        {
          "name": "Ability Score Improvement",
          "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
        }
      ]
    },
    "20": {
      "features": [
        {
          "name": "Sacred Oath Feature",
          "description": "You gain a feature from your Sacred Oath."
        }
      ]
    }
  }
}
